//******************************************
//
//	item.cpp
//	name:MasatuguKamada
//	create:2012/10/06
//	update:2012/10/06
//
//******************************************


//******************************************
//	インクルード
//******************************************
#include	<windows.h>
#include	<d3dx9.h>
#include	"main.h"
#include	"sound.h"
#include	<dinput.h>
#include	"renderer.h"
#include	"scene.h"
#include	"scene2d.h"
#include	"scene3d.h"
#include	"scene_x.h"
#include	"item.h"

//********************************************
//	クラス関数
//********************************************

//********************************************
//	コンストラクタ
//	引数
//	なし
//	戻り値
//	なし
//********************************************
CItem::CItem()
{

}

//********************************************
//	デストラクタ
//	引数
//	なし
//	戻り値
//	なし
//********************************************
CItem::~CItem()
{

}

//********************************************
//	初期化
//	引数
//	なし
//	戻り値
//	HRESULT：終了コード
//********************************************
HRESULT	CItem::Init()
{

	return	S_OK;
}

//********************************************
//	終了
//	引数
//	なし
//	戻り値
//	なし
//********************************************
void	CItem::UnInit()
{

}

//********************************************
//	更新
//	引数
//	なし
//	戻り値
//	なし
//********************************************
void	CItem::Update()
{

}


//********************************************
//	描画
//	引数
//	なし
//	戻り値
//	なし
//********************************************
void	CItem::Draw()
{

}

//********************************************
//	当たり判定
//	引数
//	D3DXVECTOR3	ItemPos:アイテムの座標
//	D3DXVECTOR3	Pos:対象の座標
//	戻り値
//	なし
//********************************************
bool	CItem::HitItem(D3DXVECTOR3 ItemPos, D3DXVECTOR3 Pos)
{
	bool	Hit = false;

	if( ItemPos.x - 0.5f < Pos.x && ItemPos.x + 0.5f > Pos.x &&
		CScene3d::GetHeight(ItemPos)  + ItemPos.y - 1.5f < Pos.y &&
		CScene3d::GetHeight(ItemPos)  + ItemPos.y + 1.5f > Pos.y &&
		ItemPos.z - 0.5f < Pos.z && ItemPos.z + 0.5f > Pos.z )
	{
		Hit = true;
		return	Hit;
	}

	return	Hit;

}



