//***************************************************************
//
//	pose.cpp
//	name:Masatugu Kamada
//	更新日：2012/08/19
//
//***************************************************************

//***************************************************************
//	インクルード
//***************************************************************
#include	<windows.h>
#include	<d3dx9.h>
#include	"main.h"
#include	"sound.h"
#include	<dinput.h>
#include	"renderer.h"
#include	"scene.h"
#include	"scene2d.h"
#include	"scene3d.h"
#include	"scene_x.h"
#include	"manager.h"
#include	"input.h"
#include	"inputkeyboard.h"
#include	"camera.h"
#include	"player.h"
#include	"light.h"
#include	"game.h"
#include	"fade.h"
#include	"pose.h"

//***************************************************************
//	静的変数
//***************************************************************
bool	CPose::m_bPose = false;

//***************************************************************
//	クラス関数
//***************************************************************

//***************************************************************
//	コンストラクタ
//	引数
//	なし
//	戻り値
//	なし
//***************************************************************
CPose::CPose()
{

}

//***************************************************************
//	デストラクタ
//***************************************************************
CPose::~CPose()
{

}

//***************************************************************
//	初期化
//引数：
//LPDIRECT3DDEVICE9 pDevice：デバイスポインタ
//戻り値：
//HRESULT	終了コード
//***************************************************************
HRESULT	CPose::Init(LPDIRECT3DDEVICE9 pDevice)
{
	//m_pPose2d = CScene2d::Create(pDevice,D3DXVECTOR3(100.0f,300.0f,0.0f),D3DXVECTOR2(350.0f,100.0f),STOP_TEXTURE_FILE,CScene2d::REZULT_TYPE);
	m_bPose = false;
	return	S_OK;
}

//***************************************************************
//	終了
//***************************************************************
void	CPose::Uninit()
{

}

//***************************************************************
//	更新
//***************************************************************
void	CPose::Update()
{
	//m_pPose2d->Update();
}
//***************************************************************
//	描画
//引数
//LPDIRECT3DDEVICE9 pDevice：デバイスポインタ
//***************************************************************
void	CPose::Draw(LPDIRECT3DDEVICE9 pDevice)
{
	//m_pPose2d->Draw(pDevice);
}
