//***************************************************************
//
//	rezult.h
//	name:Masatugu Kamada
//	更新日：2012/07/11
//
//***************************************************************

#ifndef	REZULT_H_
#define	REZULT_H_


//*****************************************************************************
//	マクロ定義
//*****************************************************************************

//*****************************************************************************
//	クラス定義
//*****************************************************************************
class	CRezult
{
public:
	CRezult();	//インストラクタ
	~CRezult();	//デストラクタ

	typedef	enum
	{
		GAME_OVER = 0,
		GAME_CLEAR,
		GAME_MAX,
	};
	HRESULT	Init(int	mode);		//初期化処理
	void	Uninit(void);	//終了処理
	void	Update(void);	//更新処理
	void	Draw(void);

private:
	static	CRenderer	*m_pRenderer;										//レンダ―変数
	int	m_nTime;
};

#endif